Documents/РасходДСПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасходДСПлан</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОД_ДоговорСЗаказчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОД_ИзППМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОД_ОтветственныйПрораб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходДСПлан/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ОД_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	ЭлДогСЗаказчиком = Элементы.Добавить("ОД_ДоговорСЗаказчиком", Тип("ПолеФормы"), Элементы.КолонкаЛево);
	ЭлДогСЗаказчиком.Вид = ВидПоляФормы.ПолеВвода;
	ЭлДогСЗаказчиком.ПутьКДанным = "Объект.ОД_ДоговорСЗаказчиком";
	ЭлДогСЗаказчиком.ТолькоПросмотр = Истина;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьДоговорСЗаказчиком();
	Иначе
		ЗаполнитьДоговорСЗаказчиком();	
	КонецЕсли;     
	
	НЭ = Элементы.Добавить("ОД_ИзППМ", Тип("ПолеФормы"), Элементы.КолонкаЛево);
	НЭ.Вид = ВидПоляФормы.ПолеФлажка;
	НЭ.ПутьКДанным = "Объект.ОД_ИзППМ";
	НЭ.Заголовок = "Из ППМ";
	НЭ.Доступность = Ложь; 
	
	ЭлементПрорабОД = Элементы.Добавить("ОД_ОтветственныйПрораб", Тип("ПолеФормы"), Элементы.КолонкаПраво);
	ЭлементПрорабОД.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПрорабОД.ПутьКДанным = "Объект.ОД_ОтветственныйПрораб"; 
	ЗаполнитьОтветственногоПрораба();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорСЗаказчиком()

	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;		
	КонецЕсли;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		Объект.ОД_ДоговорСЗаказчиком = Объект.ДокументОснование.ОД_ДоговорСЗаказчиком;
	ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Объект.ОД_ДоговорСЗаказчиком = Объект.ДокументОснование.Договор;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственногоПрораба() 
	Если Объект.ДокументОснование <> Неопределено Тогда
		Если ТипЗнч(Объект.ДокументОснование.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") И НЕ Объект.ДокументОснование.Ссылка.Пустая() Тогда   
			Объект.ОД_ОтветственныйПрораб = Объект.ДокументОснование.ОД_ОтветственныйПрораб;		
		Иначе
			Объект.ОД_ОтветственныйПрораб = Справочники.Сотрудники.ПустаяСсылка();	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
